1inputOutput/testCase/Allrun
#!/bin/bash

blockMesh > log.blockMesh
inputOutput
